
# tap repositories and their packages

tap 'homebrew/core'
brew 'bat'
brew 'ca-certificates'
brew 'coreutils'
brew 'gettext'
brew 'git'
brew 'go-task'
brew 'jq'
brew 'libgit2@1.7'
brew 'libssh2'
brew 'oniguruma'
brew 'openssl@3'
brew 'pcre2'
brew 'yq'

tap 'homebrew/cask'

tap 'rcmdnk/file'
brew 'brew-file'

cask 'visual-studio-code'
cask 'adobe-creative-cloud'
cask 'choosy'
cask '1password-cli'
cask '1password'
cask 'steam'
cask 'spotify'
cask 'sonos'
cask 'plex'

cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-bigblue-terminal-nerd-font'

# App Store applications
mas '1Password for Safari (8.10.46)', id: 1569813296
mas 'Slack (4.40.128)', id: 803453959
